Catalogs/НастройкиРассылкиЗапросовНаСверку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиРассылкиЗапросовНаСверку</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьПолныеНазванияДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьОригиналы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазбитьПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗапросаПоЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗапросаСверкиЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСверкиРасчетовСКонтрагентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматыВложенийАктаСверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматыВложенийНеПолученыОригиналы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенияТекстаШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПорядокСверкиРасчетовСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокСверкиРасчетовСКонтрагентами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапроситьАктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьНашАктСверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыЗапросаСверкиЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыЗапросаСверкиЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправитьАктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиРассылкиЗапросовНаСверку/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ДополнительныеПараметры.Свойство("АдресДанныхКонтрагента") Тогда
		ЗаполнитьЗначенияСвойств(
			ЭтотОбъект,
			Параметры.ДополнительныеПараметры,
			"Организация, ДатаНачала, ДатаОкончания, АдресДанныхКонтрагента, НаименованиеКонтрагента");
	КонецЕсли;
		
	Если Не ЭтоАдресВременногоХранилища(АдресДанныхКонтрагента)
		 Или Не ЗначениеЗаполнено(Организация)
		 Или Не ЗначениеЗаполнено(ДатаНачала)
		 Или Не ЗначениеЗаполнено(ДатаОкончания)
		 Или Не ЗначениеЗаполнено(НаименованиеКонтрагента) Тогда
		// Скроем предпросмотр
		Элементы.ГруппаШаблонСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Иначе
		Элементы.БаннерПредпросмотр.Заголовок = СтрШаблон(Элементы.БаннерПредпросмотр.Заголовок, НаименованиеКонтрагента);
		
	КонецЕсли;
		
	Если Параметры.Ключ.Пустая() Тогда
		
		// Получаем все доступные форматы печати и устанавливаем пометку у первого
		ДоступныеФорматы = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
		Первый = Истина;

		Для Каждого Формат Из ДоступныеФорматы Цикл
			
			ДоступныйФорматАкта = ФорматыВложенийАктСверки.Добавить();
			ДоступныйФорматАкта.Значение = Формат.ТипФайлаТабличногоДокумента;
			ДоступныйФорматАкта.Представление = Формат.Представление;
			ДоступныйФорматАкта.Картинка = Формат.Картинка;
			ДоступныйФорматАкта.Пометка = Первый;
	
			ДоступныйФорматОтсутствуютОригиналы = ФорматыВложенийНеПолученыОригиналы.Добавить();
			ДоступныйФорматОтсутствуютОригиналы.Значение = Формат.ТипФайлаТабличногоДокумента;
			ДоступныйФорматОтсутствуютОригиналы.Представление = Формат.Представление;
			ДоступныйФорматОтсутствуютОригиналы.Картинка = Формат.Картинка;
			ДоступныйФорматОтсутствуютОригиналы.Пометка = Первый;
	
			Первый = Ложь;
	
		КонецЦикла;
		
		СформироватьПредставлениеПараметровАктаСверки(ЭтотОбъект);
		СформироватьПредставлениеФорматовНеПолученыОригиналы(ЭтотОбъект);
		
	КонецЕсли;
	
	Элементы.ГруппаКонтрагентыЭДО.Видимость = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами();
	
	// Добавим элементы на форму для вставки параметров
	Группа = "";
	Родитель = Неопределено;
	Для Каждого ОписаниеПараметра Из РассылкаЗапросовНаСверку.ДоступныеПараметрыШаблона() Цикл
		
		Если Группа = "" Или ОписаниеПараметра.Группа <> Группа Тогда
			Группа = ОписаниеПараметра.Группа;
			Родитель = ДобавитьЭлементВставки(
				"ГруппаПараметров" + Группа,
				Тип("ГруппаФормы"),
				Группа,
				Элементы.МенюВставитьПараметр);
		КонецЕсли;
		
		ДобавитьЭлементВставки(
			ОписаниеПараметра.Имя,
			Тип("КнопкаФормы"),
			ОписаниеПараметра.ПолноеПредставлениеКоманды,
			Родитель,
			"ВставитьПараметр");
		
	КонецЦикла;
	
	Группа = "";
	Родитель = Неопределено;
	ДоступныеУсловия = Новый Соответствие;
	
	Для Каждого ОписаниеУсловия Из РассылкаЗапросовНаСверку.ДоступныеУсловияШаблона() Цикл
		
		Если Группа = "" Или ОписаниеУсловия.Группа <> Группа Тогда
			Группа = ОписаниеУсловия.Группа;
			Родитель = ДобавитьЭлементВставки(
				"ГруппаУсловий" + Группа,
				Тип("ГруппаФормы"),
				Группа,
				Элементы.МенюВставитьУсловие);
		КонецЕсли;
		
		ДобавитьЭлементВставки(
			ОписаниеУсловия.Имя,
			Тип("КнопкаФормы"),
			ОписаниеУсловия.ПолноеПредставлениеКоманды,
			Родитель,
			"ВставитьУсловие");
		
		ДоступныеУсловия.Вставить(ОписаниеУсловия.Имя, ОписаниеУсловия.ОписаниеДействия);
		
		ДобавитьЭлементВставки(
			"Не_" + ОписаниеУсловия.Имя,
			Тип("КнопкаФормы"),
			ОписаниеУсловия.ПолноеПредставлениеКомандыОбратноеУсловие,
			Родитель,
			"ВставитьУсловие");
			
		ДоступныеУсловия.Вставить("Не_" + ОписаниеУсловия.Имя, ОписаниеУсловия.ОписаниеДействияОбратноеУсловие);
	
	КонецЦикла;
	
	УсловияТекстаПисьма = Новый ФиксированноеСоответствие(ДоступныеУсловия);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Вложения = ТекущийОбъект.ВложенияТекстаШаблона.Получить();
	Если Вложения = Неопределено Тогда
		Вложения = Новый Структура;
	КонецЕсли;
	ШаблонПисьма.УстановитьHTML(ТекущийОбъект.ШаблонПисьма, Вложения);
	
	// Получаем сохранённые форматы из реквизитов объекта
	ФорматыАктаСверки = ТекущийОбъект.ФорматыВложенийАктаСверки.Получить();
	Если Не ЗначениеЗаполнено(ФорматыАктаСверки) Тогда
		ФорматыАктаСверки = Новый Массив;
	КонецЕсли;

	ФорматыОтсутствуютОригиналы = ТекущийОбъект.ФорматыВложенийНеПолученыОригиналы.Получить();
	Если Не ЗначениеЗаполнено(ФорматыОтсутствуютОригиналы) Тогда
		ФорматыОтсутствуютОригиналы = Новый Массив;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФорматыВложенийАктСверки) Или Не ЗначениеЗаполнено(ФорматыВложенийНеПолученыОригиналы) Тогда
	
		// Получаем все доступные форматы печати
		ДоступныеФорматы = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
		
		ФорматыВложенийАктСверки.Очистить();
		ФорматыВложенийНеПолученыОригиналы.Очистить();
		
		// Заполняем списки форматов для акта сверки и неполученных оригиналов
		Для Каждого Формат Из ДоступныеФорматы Цикл
			
			ДоступныйФорматАкта = ФорматыВложенийАктСверки.Добавить();
			ДоступныйФорматАкта.Значение = Формат.ТипФайлаТабличногоДокумента;
			ДоступныйФорматАкта.Представление = Формат.Представление;
			ДоступныйФорматАкта.Картинка = Формат.Картинка;
			ДоступныйФорматАкта.Пометка = (ФорматыАктаСверки.Найти(Формат.ТипФайлаТабличногоДокумента) <> Неопределено);

			ДоступныйФорматОтсутствуютОригиналы = ФорматыВложенийНеПолученыОригиналы.Добавить();
			ДоступныйФорматОтсутствуютОригиналы.Значение = Формат.ТипФайлаТабличногоДокумента;
			ДоступныйФорматОтсутствуютОригиналы.Представление = Формат.Представление;
			ДоступныйФорматОтсутствуютОригиналы.Картинка = Формат.Картинка;
			ДоступныйФорматОтсутствуютОригиналы.Пометка = 
				(ФорматыОтсутствуютОригиналы.Найти(Формат.ТипФайлаТабличногоДокумента) <> Неопределено);

		КонецЦикла;
			
	КонецЕсли;
	
	СформироватьПредставлениеПараметровАктаСверки(ЭтотОбъект);
	СформироватьПредставлениеФорматовНеПолученыОригиналы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ПорядокСверки = Перечисления.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки Тогда
	
		ЕстьВыбранные = Ложь;
		Для Каждого Формат Из ФорматыВложенийАктСверки Цикл
			Если Формат.Пометка Тогда
				ЕстьВыбранные = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьВыбранные Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Выберите формат файла акта сверки для приложения к письму'"),
				Объект.Ссылка,
				"ФорматыВложенийАктСверки",
				,
				Отказ);
		КонецЕсли;
	
	КонецЕсли;
	
	Если Объект.ЗапрашиватьОригиналы Тогда
	
		ЕстьВыбранные = Ложь;
		Для Каждого Формат Из ФорматыВложенийНеПолученыОригиналы Цикл
			Если Формат.Пометка Тогда
				ЕстьВыбранные = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьВыбранные Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Выберите формат файла неполученных оригиналов для приложения к письму'"),
				Объект.Ссылка,
				"ФорматыВложенийНеПолученыОригиналы",
				,
				Отказ);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ФорматыАктаСверки = Новый Массив;
	
	Для Каждого Формат Из ФорматыВложенийАктСверки Цикл
		Если Формат.Пометка Тогда
			ФорматыАктаСверки.Добавить(Формат.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ТекущийОбъект.ФорматыВложенийАктаСверки = Новый ХранилищеЗначения(ФорматыАктаСверки);
	
	ФорматыНеПолученыОригиналы = Новый Массив;
	
	Для Каждого Формат Из ФорматыВложенийНеПолученыОригиналы Цикл
		Если Формат.Пометка Тогда
			ФорматыНеПолученыОригиналы.Добавить(Формат.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ТекущийОбъект.ФорматыВложенийНеПолученыОригиналы = Новый ХранилищеЗначения(ФорматыНеПолученыОригиналы);
	
	Вложения = Новый Структура;
	ШаблонПисьма.ПолучитьHTML(ТекущийОбъект.ШаблонПисьма, Вложения);
	ТекущийОбъект.ВложенияТекстаШаблона = Новый ХранилищеЗначения(Вложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Если объект записан и закрывается, то нужно вернуть ссылку в форму-инициатор
	Если Не Модифицированность И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Закрыть(Объект.Ссылка);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПорядокСверкиПриИзменении(Элемент)
	
	ПорядокСверкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровАктаСверки(Элемент)
	
	ОтключитьОбработчикОжидания("СформироватьПредставлениеПараметровАктаСверкиСОжиданием");
	ПодключитьОбработчикОжидания("СформироватьПредставлениеПараметровАктаСверкиСОжиданием", 1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьОригиналыПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
	Если Элементы.ГруппаШаблонСтраницы.ТекущаяСтраница = Элементы.СтраницаПросмотр Тогда
		СформироватьПредпросмотр();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматыВложенийНеПолученыОригиналыПриИзменении(Элемент)
	ПриИзмененииФорматовВложенийНеПолученыОригиналы();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаШаблонСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаПросмотр Тогда
		СформироватьПредпросмотр();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВставитьПараметр(Команда)
	
	ИмяПараметра = СтрЗаменить(Команда.Имя, "ВставитьПараметр", "");
	ЗначениеВставки = СтрШаблон("[%1]", ИмяПараметра);
	
	Если ТекущийЭлемент = Элементы.ШаблонТемы Тогда
		
		НачалоСтроки = 0;
		ПозицияНачала = 0;
		КонецСтроки = 0;
		ПозицияОкончания = 0;
		Элементы.ШаблонТемы.ПолучитьГраницыВыделения(НачалоСтроки, ПозицияНачала, КонецСтроки, ПозицияОкончания);
		
		Объект.ШаблонТемы = 
			Лев(Объект.ШаблонТемы, ПозицияНачала - 1)
			+ ЗначениеВставки
			+ Сред(Объект.ШаблонТемы, ПозицияОкончания);
			
		ОбновитьОтображениеДанных(Элементы.ШаблонТемы);
		
		ПозицияОкончания = ПозицияНачала + СтрДлина(ЗначениеВставки);
		Элементы.ШаблонТемы.УстановитьГраницыВыделения(НачалоСтроки, ПозицияНачала, КонецСтроки, ПозицияОкончания);
		
		Модифицированность = Истина;
		Возврат;
		
	КонецЕсли;
	
	ЗакладкаНачала = Неопределено;
	ЗакладкаОкончания = Неопределено;
	Элементы.ШаблонПисьма.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);

	ПозицияНачала = ШаблонПисьма.ПолучитьПозициюПоЗакладке(ЗакладкаНачала);
	ПозицияОкончания = ШаблонПисьма.ПолучитьПозициюПоЗакладке(ЗакладкаОкончания);
	
	// Если выделен текст, то удаляем его - ниже вместо него вставим параметр
	Если ЗакладкаНачала <> ЗакладкаОкончания Тогда 
		ШаблонПисьма.Удалить(ЗакладкаНачала, ЗакладкаОкончания);
		Элементы.ШаблонПисьма.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаНачала);
	КонецЕсли;
	
	// Вставляем параметр на место курсора
	Если ШаблонПисьма.Элементы.Количество() = 0 Тогда
		ШаблонПисьма.Добавить(ЗначениеВставки, Тип("ТекстФорматированногоДокумента"));
	Иначе
		ШаблонПисьма.Вставить(ЗакладкаНачала, ЗначениеВставки, Тип("ТекстФорматированногоДокумента"));
	КонецЕсли;
	
	// Выделяем вставленный текст параметра
	ПозицияОкончания = ПозицияНачала + СтрДлина(ЗначениеВставки);
	ЗакладкаОкончания = ШаблонПисьма.ПолучитьЗакладкуПоПозиции(ПозицияОкончания);
	Элементы.ШаблонПисьма.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьУсловие(Команда)
	
	ИмяУсловия = СтрЗаменить(Команда.Имя, "ВставитьУсловие", "");
	
	// Вставим теги условного блока, а между ними - текст действия.
	// Текст действия берем из закэшированного соответствия.
	ТекстДействия = УсловияТекстаПисьма.Получить(ИмяУсловия);
	Если ТекстДействия = Неопределено Тогда
		ТекстДействия = Нстр("ru = 'Введите свой текст здесь'");
	КонецЕсли;
	
	// Условие может быть инвертировано с помощью "Не " перед именем условия
	Префикс = "";
	Если СтрНачинаетсяС(ИмяУсловия, "Не_")Тогда
		Префикс = "Не ";
		ИмяУсловия = Сред(ИмяУсловия, 4);
	КонецЕсли;
	
	// Соберем весь условный блок
	ТегНачалоУсловия = РассылкаЗапросовНаСверкуКлиентСервер.ТегНачалоУсловия(Префикс + ИмяУсловия);
	ТегОкончаниеУсловия = РассылкаЗапросовНаСверкуКлиентСервер.ТегОкончаниеУсловия();
	
	ЧастиВставки = Новый Массив;
	ЧастиВставки.Добавить(ТегНачалоУсловия);
	ЧастиВставки.Добавить(ТекстДействия);
	ЧастиВставки.Добавить(ТегОкончаниеУсловия);
	
	ЗначениеВставки = СтрСоединить(ЧастиВставки);
	
	Если ТекущийЭлемент = Элементы.ШаблонТемы Тогда
		
		НачалоСтроки = 0;
		ПозицияНачала = 0;
		КонецСтроки = 0;
		ПозицияОкончания = 0;
		Элементы.ШаблонТемы.ПолучитьГраницыВыделения(НачалоСтроки, ПозицияНачала, КонецСтроки, ПозицияОкончания);
		
		Объект.ШаблонТемы = 
			Лев(Объект.ШаблонТемы, ПозицияНачала - 1)
			+ ЗначениеВставки
			+ Сред(Объект.ШаблонТемы, ПозицияОкончания);
		
		ОбновитьОтображениеДанных(Элементы.ШаблонТемы);
		
		ПозицияНачала = ПозицияНачала + СтрДлина(ТегНачалоУсловия);
		ПозицияОкончания = ПозицияНачала + СтрДлина(ТекстДействия);
		Элементы.ШаблонТемы.УстановитьГраницыВыделения(НачалоСтроки, ПозицияНачала, КонецСтроки, ПозицияОкончания);
		
		Модифицированность = Истина;
		Возврат;
		
	КонецЕсли;
	
	ЗакладкаНачала = Неопределено;
	ЗакладкаОкончания = Неопределено;
	Элементы.ШаблонПисьма.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
	
	ПозицияНачала = ШаблонПисьма.ПолучитьПозициюПоЗакладке(ЗакладкаНачала);
	
	// Если выделен текст, то удаляем его - ниже вместо него вставим условие
	Если ЗакладкаНачала <> ЗакладкаОкончания Тогда 
		ШаблонПисьма.Удалить(ЗакладкаНачала, ЗакладкаОкончания);
		Элементы.ШаблонПисьма.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаНачала);
	КонецЕсли;
	
	// Вставляем условие на место курсора
	Если ШаблонПисьма.Элементы.Количество() = 0 Тогда
		ШаблонПисьма.Добавить(ЗначениеВставки, Тип("ТекстФорматированногоДокумента"));
	Иначе
		ШаблонПисьма.Вставить(ЗакладкаНачала, ЗначениеВставки, Тип("ТекстФорматированногоДокумента"));
	КонецЕсли;
	
	// Выделяем часть вставленного текста условия - текст описания действия, который пользователь должен поменять
	ПозицияНачала = ПозицияНачала + СтрДлина(ТегНачалоУсловия);
	ПозицияОкончания = ПозицияНачала + СтрДлина(ТекстДействия);
	ЗакладкаНачала = ШаблонПисьма.ПолучитьЗакладкуПоПозиции(ПозицияНачала);
	ЗакладкаОкончания = ШаблонПисьма.ПолучитьЗакладкуПоПозиции(ПозицияОкончания);
	Элементы.ШаблонПисьма.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстИзШаблона(Команда)
	
	Если ЗначениеЗаполнено(ШаблонПисьма.ПолучитьТекст()) Тогда
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЗаполнитьТекстИзШаблонаЗавершение", ЭтотОбъект),
			НСтр("ru = 'Текст письма будет перезаполнен из шаблона. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьТекстИзШаблонаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ОтправитьНашАктСверки =
		(Объект.ПорядокСверки = ПредопределенноеЗначение("Перечисление.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки"));
	
	Элементы.ГруппаПараметрыАктаСверки.Доступность = ОтправитьНашАктСверки;
	Элементы.ГруппаФорматыВложенийНеПолученыОригиналы.Доступность = Объект.ЗапрашиватьОригиналы;
	Элементы.ЭДООтправитьАктСверки.Видимость = ОтправитьНашАктСверки;
	
КонецПроцедуры

&НаСервере
Процедура ПорядокСверкиПриИзмененииНаСервере()
	
	Если Объект.ПорядокСверки <> Перечисления.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки
		 И Объект.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьАктСверки Тогда
		Объект.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьПисьмо;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеПараметровАктаСверкиСОжиданием() Экспорт
	СформироватьПредставлениеПараметровАктаСверки(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПараметровАктаСверки(Форма)
	
	Объект = Форма.Объект;

	ПредставлениеПараметров = Новый Массив;

	Если Объект.РазбитьПоДоговорам Тогда
		ПредставлениеПараметров.Добавить(НСтр("ru='по договорам'"));
	КонецЕсли;

	Если Объект.ВыводитьПолныеНазванияДокументов Тогда
		ПредставлениеПараметров.Добавить(НСтр("ru='полные названия документов'"));
	КонецЕсли;

	Если Объект.ВыводитьСчетаФактуры Тогда
		ПредставлениеПараметров.Добавить(НСтр("ru='выводить СФ'"));
	КонецЕсли;

	ФорматыПечатиАктаСверки = Новый Массив;
	Для Каждого Формат Из Форма.ФорматыВложенийАктСверки Цикл
		Если Формат.Пометка Тогда
			ФорматыПечатиАктаСверки.Добавить(НРег(Формат.Представление));
		КонецЕсли;
	КонецЦикла;

	Если ФорматыПечатиАктаСверки.Количество() > 0 Тогда
		ПредставлениеПараметров.Добавить(СтрСоединить(ФорматыПечатиАктаСверки, ", "));
	КонецЕсли;

	Если ПредставлениеПараметров.Количество() > 0 Тогда
		Представление = СтрСоединить(ПредставлениеПараметров, "; ");
		Форма.Элементы.ГруппаПараметрыАктаСверки.Заголовок = ВРег(Лев(Представление, 1)) + Сред(Представление, 2);
	Иначе
		Форма.Элементы.ГруппаПараметрыАктаСверки.Заголовок = НСтр("ru='<не выбран>'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФорматовВложенийНеПолученыОригиналы()
	
	ОтключитьОбработчикОжидания("СформироватьПредставлениеФорматовНеПолученыОригиналыСОжиданием");
	ПодключитьОбработчикОжидания("СформироватьПредставлениеФорматовНеПолученыОригиналыСОжиданием", 1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеФорматовНеПолученыОригиналыСОжиданием() Экспорт
	СформироватьПредставлениеФорматовНеПолученыОригиналы(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеФорматовНеПолученыОригиналы(Форма)
	
	ФорматыВложений = Новый Массив;
	Для Каждого Формат Из Форма.ФорматыВложенийНеПолученыОригиналы Цикл
		Если Формат.Пометка Тогда
			ФорматыВложений.Добавить(НРег(Формат.Представление));
		КонецЕсли;
	КонецЦикла;

	Если ФорматыВложений.Количество() > 0 Тогда
		Представление = СтрСоединить(ФорматыВложений, ", ");
		Форма.Элементы.ГруппаФорматыВложенийНеПолученыОригиналы.Заголовок = ВРег(Лев(Представление, 1)) + Сред(Представление, 2);
	Иначе
		Форма.Элементы.ГруппаФорматыВложенийНеПолученыОригиналы.Заголовок = НСтр("ru='<не выбран>'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементВставки(Знач ИмяЭлемента, ТипЭлемента, Заголовок, Родитель, Действие = "")
	
	Если ТипЭлемента = Тип("КнопкаФормы") И ЗначениеЗаполнено(Действие) Тогда
		ИмяЭлемента = Действие + ИмяЭлемента;
		Команда = Команды.Добавить(ИмяЭлемента);
		Команда.Действие = Действие;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, ТипЭлемента, Родитель);
	
	Если ТипЭлемента = Тип("ГруппаФормы") Тогда
		НовыйЭлемент.Вид = ВидГруппыФормы.ГруппаКнопок;
	ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") Тогда
		НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КонецЕсли;
	
	НовыйЭлемент.Заголовок = Заголовок;
	
	Если ТипЭлемента = Тип("КнопкаФормы") И ЗначениеЗаполнено(Действие) Тогда
		НовыйЭлемент.ИмяКоманды = Команда.Имя;
	КонецЕсли;
	
	Возврат НовыйЭлемент;

КонецФункции

&НаСервере
Процедура СформироватьПредпросмотр()
	
	ТаблицаКонтрагента = ПолучитьИзВременногоХранилища(АдресДанныхКонтрагента);
	
	Если ТаблицаКонтрагента.Количество() = 0 Тогда
		ВызватьИсключение Нстр("ru = 'Не заполнен контрагент для предпросмотра'");
	КонецЕсли;
	
	ВложенияТекстаШаблона = Новый Структура;
	ШаблонПисьма.ПолучитьHTML(Объект.ШаблонПисьма, ВложенияТекстаШаблона);
	
	Ошибки = Новый Массив;
	
	ОбщиеПараметрыСверки = Обработки.МониторСверкиСКонтрагентами.ОбщиеПараметрыСверки(Организация, ДатаНачала, ДатаОкончания);
	
	КонтекстРассылки = РассылкаЗапросовНаСверку.НовыйКонтекстРассылки();
	КонтекстРассылки.НастройкаРассылки = Объект;

	ПолучателиРассылки = РассылкаЗапросовНаСверку.ПолучателиРассылки(ТаблицаКонтрагента);
	РассылкаЗапросовНаСверку.ЗаполнитьСообщенияПолучателямРассылки(
		ПолучателиРассылки, КонтекстРассылки, ОбщиеПараметрыСверки, Ошибки);

	Если Ошибки.Количество() Тогда
		ТекстОшибок = СтрШаблон(Нстр("ru = 'При подготовке предпросмотра возникли ошибки:
			|%1'"),
			СтрСоединить(Ошибки, Символы.ПС));
		ВызватьИсключение ТекстОшибок;
	КонецЕсли;
	
	ПолучателиРассылки.Колонки.Контрагент.Имя = "Получатель";
	ПолучательРассылки = ПолучателиРассылки[0];
	
	ПредпросмотрТемы = ПолучательРассылки.ТемаПисьма;
	
	ПредпросмотрПисьма.УстановитьHTML(ПолучательРассылки.ТекстПисьма, ВложенияТекстаШаблона);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Записать();
	Модифицированность = Ложь; // не выводить подтверждение о закрытии формы еще раз.
	Закрыть(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстИзШаблонаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТекстИзШаблонаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстИзШаблонаНаСервере()
	
	ИмяШаблона = "";
	
	ИспользуетсяОбменЭлектроннымиДокументами = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами()
		И СинхронизацияЭДО.ЕстьУчетныеЗаписи(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	
	Если Объект.ПорядокСверки = ПредопределенноеЗначение("Перечисление.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки")
		 И ИспользуетсяОбменЭлектроннымиДокументами Тогда
		ИмяШаблона = "ШаблонПисьма_ОтправитьАкт";
	ИначеЕсли Объект.ПорядокСверки = ПредопределенноеЗначение("Перечисление.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки") Тогда
		ИмяШаблона = "ШаблонПисьма_ОтправитьАкт_НетЭДО";
	ИначеЕсли Объект.ПорядокСверки = ПредопределенноеЗначение("Перечисление.ПорядокСверкиРасчетовСКонтрагентами.ЗапроситьАктСверки")
		 И ИспользуетсяОбменЭлектроннымиДокументами Тогда
		ИмяШаблона = "ШаблонПисьма_ЗапроситьАкт";
	Иначе
		ИмяШаблона = "ШаблонПисьма_ЗапроситьАкт_НетЭДО";
	КонецЕсли;
	
	Вложения = Новый Структура;
	ШаблонПисьма.УстановитьHTML(Справочники.НастройкиРассылкиЗапросовНаСверку.ТекстШаблона(ИмяШаблона), Вложения);

КонецПроцедуры

#КонецОбласти
